# Data Manipulation and Preparation with Pandas
_Week 3_

In [4]:
# Loading the dataset
import pandas
df = pandas.read_csv('netherlands_IT_salaries.csv')

## Sorting Data

- Sort the dataset by Salary in descending order
- Sort by City and then by Role, both in ascending order

#TODO MEGAN

In [6]:
#TODO
import pandas as pd

df = pd.read_excel('netherlands_IT_salaries.xlsx')
descending = df.sort_values(by='Salary',ascending=False)

city = df.sort_values(by='City',ascending=True)
role = df.sort_values(by='Role',ascending=True)

## Handling Missing Data

· Check if there are any missing values in each column.

· Display only the rows with missing values.

· Fill missing Education values with 'Unknown'.

· Replace missing Salary values (if any) with the average salary.

· Drop rows where City is missing.

· Decide what to do with missing values in Experience.

In [8]:
#TODO
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1134 entries, 0 to 1133
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1134 non-null   int64
 1   Age         1134 non-null   int64
 2   Role        1134 non-null   object
 3   City        877 non-null    object
 4   Education   1070 non-null   object
 5   Experience  1130 non-null   float64
 6   Salary      1101 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 62.1+ KB

In [8]:
#TODO
df_missing = df[df.isna().any(axis=1)]
print(df_missing)

      Year  Age                 Role    City Education  Experience  Salary
2     2018   42        BI Consultant     NaN       MBO        25.0  4400.0
6     2018   38    Software Engineer     NaN       HBO        11.0  3350.0
10    2018   36       Lead Developer  Arnhem       NaN        16.0  4100.0
14    2018   36        Web Developer     NaN        WO         3.0  2100.0
18    2018   34       Cloud Engineer     NaN       HBO        15.0  5150.0
...    ...  ...                  ...     ...       ...         ...     ...
1120  2021   24  Front-end Developer     NaN       HBO         0.0  2600.0
1121  2021   24       Lead Developer     NaN       NaN         6.0  7679.0
1122  2021   24    Software Engineer     NaN       HBO         2.0  2600.0
1127  2021   23   Low Code Developer     NaN       HBO         2.0  3700.0
1128  2021   23   Helpdeskmedewerker     NaN       MBO         0.0  2550.0

[327 rows x 7 columns]

In [12]:
#TODO
df['Education'].fillna('Unknown', inplace=True)
df

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

In [10]:
#TODO
df['Salary'].fillna(df['Salary'].mean(), inplace=True)

df

C:\Windows\Temp\ipykernel_15980\122011522.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

In [12]:
#TODO
df.dropna(subset=['City'])
df

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

In [14]:
#TODO
df['Experience'].fillna(df['Experience'].mean(), inplace=True)

df

C:\Windows\Temp\ipykernel_15980\1034986529.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Experience'].fillna(df['Experience'].mean(), inplace=True)

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

## Removing Duplicates


· Check if there are any duplicate rows.

· If duplicates exist, remove them while keeping only the first occurrence.

In [16]:
#TODO PAUL

is_duplicated = df.duplicated().any()
print(is_duplicated)

True

In [18]:
#TODO PAUL
df.drop_duplicates(inplace=True)

# Detecting Outliers

· Use the Interquartile Range (IQR) method to identify potential outliers in Salary.

· Display the rows containing salary outliers.

· Remove detected outliers from the dataset.

In [20]:
#TODO PAUL
Q1 = df["Salary"].quantile(0.25)
Q3 = df["Salary"].quantile(0.75)
IQR = Q3 - Q1
Outliers = df[(df["Salary"] < (Q1 - 1.5 * IQR)) | (df["Salary"] > (Q3 + 1.5 * IQR))]

In [22]:
#TODO PAUL
print(Outliers)

      Year  Age                                   Role           City  \
24    2018   32                 Integration consultant       Randstad
114   2019   50            IT infrastructuur Architect            NaN
115   2019   49                      Solution Engineer            NaN
126   2019   40           Manager Business Development            NaN
127   2019   40               Service Delivery Manager           Lund
135   2019   38                     Solution Architect       Randstad
138   2019   38                             IT Auditor      Amsterdam
188   2019   33                      Solution Engineer            NaN
214   2019   32                           Data Analyst       randstad
219   2019   32  Programmamanager met 8 direct reports       Randstad
244   2019   31                        Success Manager      Amsterdam
268   2019   30                    Front-end Developer        Tilburg
305   2019   29                      Software Engineer        Utrecht
448   2019   25              Consultant/Data scientist       Randstad
531   2019   23                         Lead Developer            NaN
560   2019   21                    Front-end Developer      Amsterdam
565   2020   52                         Projectmanager        Utrecht
570   2020   41                           Test Manager       randstad
572   2020   40                         Cloud Engineer      Eindhoven
573   2020   40                       Support Engineer            NaN
578   2020   39                             IT Manager      Eindhoven
580   2020   39                             IT Manager       Randstad
583   2020   39                     Solution Architect       Randstad
593   2020   36                             IT Manager            NaN
599   2020   36                    Front-end Developer            NaN
600   2020   36                         Lead Developer      Eindhoven
602   2020   36               Customer Success Manager        Utrecht
623   2020   34                         Cloud Engineer        Utrecht
667   2020   31                             IT Manager  Noord-Holland
688   2020   30                             IT Manager  Noord-Holland
774   2020   28                         Data Scientist      Amsterdam
821   2020   26                       Business Analyst        Utrecht
926   2021   48                     Technical Director      Amsterdam
933   2021   40                             IT Manager      Eindhoven
934   2021   40                   Development Engineer      Eindhoven
937   2021   39                     Software architect       randstad
938   2021   39                         Lead Developer       Randstad
943   2021   38                             IT Manager   Brabant-Zuid
953   2021   36                             IT Manager      Rotterdam
978   2021   33                             IT Manager  Noord-Holland
989   2021   32                          Product Owner     Gelderland
1003  2021   31                   Technical Consultant      Eindhoven
1011  2021   30                      Software Engineer        Utrecht
1026  2021   30                       Security Manager            NaN
1068  2021   27                      Software Engineer            NaN
1075  2021   26                      Software Engineer            NaN
1080  2021   26                      Software Engineer      Eindhoven
1100  2021   25                         Lead Developer            NaN
1121  2021   24                         Lead Developer            NaN

     Education  Experience   Salary
24         HBO         8.0  10000.0
114        MBO        28.0   6500.0
115        NaN         7.0   6300.0
126         WO        16.0   9100.0
127        HBO         2.0   6400.0
135        HBO        20.0  10780.0
138         WO        15.0   7560.0
188        HBO        10.0   6250.0
214        HBO         7.0   6465.0
219         WO         9.0   6700.0
244        NaN         5.0   6875.0
268        NaN         6.0      2.0
305        HBO         6.0   6400.0
448         WO         1.0      3.0
531        HBO         9.0   7983.0
560        NaN         4.0      3.0
565        HBO        30.0   7100.0
570        HBO         3.0   6275.0
572        HBO        16.0   8328.0
573        HBO        20.0   6666.0
578         WO        13.0   8565.0
580       HAVO        20.0   6714.0
583        HBO        21.0  11137.0
593        HBO        12.0   7474.0
599        NaN        19.0   7200.0
600        HBO        16.0   6500.0
602        HBO        15.0   6374.0
623        MBO        15.0   6300.0
667         WO         6.0   6700.0
688         WO         5.0   6300.0
774         WO         4.0   6800.0
821        HBO         1.0     36.0
926        NaN        25.0   7200.0
933         WO        14.0   8178.0
934         WO        13.0   6800.0
937         WO        13.0   6400.0
938        MBO        15.0   7700.0
943         WO        19.0   9075.0
953         WO        11.0   8833.0
978        MBO        13.0   8900.0
989        HBO         5.0   6350.0
1003       MBO        12.0    143.0
1011       HBO         8.0   6500.0
1026        WO         7.0   6900.0
1068       HBO         4.0   6500.0
1075       HBO         1.0      2.0
1080       HBO         1.0      3.0
1100       HBO        10.0   9083.0
1121       NaN         6.0   7679.0

In [24]:
#TODO PAUL
for i in Outliers.index:
    df.drop(i, inplace=True)

# GroupBy Operations

· Group the data by City and calculate:

o The average salary in each city.

o The number of roles in each city.

· Group the data by Education and find the maximum salary for each education level.

· Group the data by Seniority and find the median salary for each seniority level.

In [47]:
avg_salary = df.groupby("City")["Salary"].mean()
role_count = df.groupby("City")["Role"].count()
print("Avg salary: \n", avg_salary)
print("Role count: \n", role_count)

Avg salary:
 City
's Hertogenbosch    3300.000000
(Zuid) Limburg      3000.000000
Achterhoek          2604.000000
Alkmaar             3633.333333
Almelo              3418.000000
                       ...
de Meern            2700.000000
dokkum              2500.000000
vogelenzang         5450.000000
zuid Limburg        2145.000000
zwijndrecht         3472.000000
Name: Salary, Length: 133, dtype: float64
Role count:
 City
's Hertogenbosch    9
(Zuid) Limburg      1
Achterhoek          1
Alkmaar             3
Almelo              2
                   ..
de Meern            1
dokkum              1
vogelenzang         1
zuid Limburg        1
zwijndrecht         1
Name: Role, Length: 133, dtype: int64

In [43]:
max_salary = df.groupby("Education")["Salary"].max()
print(max_salary)

Education
B          4300.00000
HAVO       5500.00000
HBO        6000.00000
HBO, WO    3150.00000
HIO        4950.00000
Havo       3800.00000
IT         3511.18347
MBO        5996.00000
MBOo 3     3240.00000
Mavo       4700.00000
VMBO       2100.00000
VWO        5473.00000
WO         6150.00000
ul         3100.00000
Name: Salary, dtype: float64

In [45]:
median_salary = df.groupby("Experience")["Salary"].median()
print(median_salary)

Experience
0.000000     2600.00000
1.000000     2700.00000
2.000000     2869.50000
3.000000     3049.00000
4.000000     3300.00000
5.000000     3400.00000
5.519469     3105.50000
6.000000     3511.18347
7.000000     3690.00000
8.000000     3619.00000
9.000000     3775.00000
10.000000    3802.50000
11.000000    4124.00000
12.000000    4300.00000
13.000000    4050.00000
14.000000    4243.00000
15.000000    5100.00000
16.000000    4100.00000
17.000000    4300.00000
18.000000    3860.00000
19.000000    4200.00000
20.000000    4400.00000
21.000000    4200.00000
22.000000    4545.00000
25.000000    4400.00000
27.000000    4500.00000
Name: Salary, dtype: float64

# Apply and Map Functions

· Add a new column Annual Salary by applying a function to calculate Salary x 12.

· Use the .map() function to categorize education levels into 'Low', 'Medium', and 'High':

o       MBO, Mavo, and Unknown → 'Low'

o       HBO → 'Medium'

o       WO → 'High'

o       Store the new values in a column called Education Level.

In [51]:
df["Annual Salary"] = df["Salary"] * 12
print(df["Annual Salary"])

      Year  Age                  Role       City Education  Experience  \
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0
2     2018   42         BI Consultant        NaN       MBO        25.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0
...    ...  ...                   ...        ...       ...         ...
1129  2021   23        Data Scientist   Randstad        WO         0.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0
1133  2021   21     Software Engineer      Breda       MBO         1.0

      Salary  Annual Salary
0     4950.0        59400.0
1     4086.0        49032.0
2     4400.0        52800.0
3     3600.0        43200.0
4     4900.0        58800.0
...      ...            ...
1129  3750.0        45000.0
1130  2375.0        28500.0
1131  2850.0        34200.0
1132  2500.0        30000.0
1133  2385.0        28620.0

[1078 rows x 8 columns]

In [68]:
education_map = {
    "MBO": "Low",
    "Mavo": "Low",
    "Unknown": "Low",
    "HBO": "Medium",
    "WO": "High"
}

df["Education Level"] = df["Education"].map(education_map)
print(df["Education Level"])

SyntaxError: unterminated string literal (detected at line 2) (344578369.py, line 2)

# Feature Engineering

· Create a new column Year of Birth using the formula: Year - Age.

· Create a new column Seniority based on experience:

o Less than 5 years → 'Junior'

o Between 5 and 10 years → 'Mid-level'

o More than 10 years → 'Senior'

· Create a new column City Category:

o If the city is 'Randstad', 'Amsterdam', or 'Utrecht', categorize it as 'Urban'.

o Otherwise, categorize it as 'Non-Urban'.

· Create a new column Salary Bracket based on salary:

o Less than €3000 → 'Low'

o Between €3000 and €5000 → 'Medium'

o More than €5000 → 'High'.

In [ ]:
#TODO

In [ ]:
#TODO

In [ ]:
#TODO

In [ ]:
#TODO

# Advanced Analysis

· Find the top 5 highest-paying roles.

· Find the most common role in the dataset.

In [ ]:
#TODO

In [ ]:
#TODO

# Save the Cleaned Data

· Save the final cleaned dataset to a CSV file named cleaned_IT_salaries.csv.

In [ ]:
#TODO